feat: chronicle agent
